public class H_W_8_zad0 {
    public static void main(String[] args) {
        //Представете си, че сте на гише за регистрация за игра на мини голф. Започвате
        //деня с 20 топчета за голф. Работата ви е да давате по едно топче и един стик на
        //всеки регистриран играч. Проследете с програма как се променят наличните
        //топчета през деня:
        //• Идват 2 ма играча;
        //• Идва група от 5 ма играча;
        //• Идва група от 3 ма играча;
        //• Първите двама приключват и връщат топчетата;
        //• Идва група от 4 ма играча;
        //• Идва група от 6 ма играча;
        //• Групата от 5 човека приключва играта и връща оборудването, но 2 ма от тях

        int balls = 20; //стартираме с 20 топчета
        System.out.println("Налични топчета: " + balls);
        balls = balls - 2; // Идват 2 ма играча;
        System.out.println("След двамата играча, топчетата са: " + balls);
        balls = balls -5; //Идва група от 5 ма играча
        System.out.println("След още 5 играча, топчетата са: " + balls);
        balls = balls - 3; //Идва група от 3 ма играча
        System.out.println("След още 3-ма играчи, топчетата са: " + balls);
        balls = balls + 2; //Първите двама приключват и връщат топчетата
        System.out.println("Двама играча приключват и топчетата са: " + balls);
        balls = balls - 4; //Идва група от 4 ма играча
        System.out.println("Идва група от 4-ма играчи и топчетата са: " + balls);
        balls = balls - 6; //Идва група от 6 ма играча
        System.out.println("Идва група от 6-ма играчи и топчетата са вече: " + balls);
        balls = balls + 5 -2; //Групата от 5 човека приключва играта и връща оборудването,
                            // но 2 ма от тях решават да направят и втора обиколка
        System.out.println("Група от 5-ма приключват, \nно 2-ма от тях решават да играят още и топчетата са: " + balls);




    }


}
